;Place localized text in this file

; Kevlar Variants
[LightKevlarArmor X2ArmorTemplate]
FriendlyName="Light Kevlar Armor"
FriendlyNamePlural="Light Kevlars"
BriefSummary="The lightest basic armor available to XCOM. Only the bravest and reckless among our operatives would forgo any protective plating in order to benefit from that potentially vital boost to combat mobility it affords."
TacticalText="<Bullet/>Provides +5 defense\n<Bullet/>Sacrifices all protective measures to allow the greatest boost in mobility on the field.\n<Bullet/>This heightened mobility may give our operatives a greater chance of avoiding incoming fire in the right circumstances"

[KevlarArmor X2ArmorTemplate]
FriendlyName="Medium Kevlar Armor"
FriendlyNamePlural="Medium Kevlars"
BriefSummary="The Standard issue combat armor issued to our frontline troops. Though not up to the same standard as ADVENT's equivalent, the plating in this Kevlar should provide some modicum of protection"
TacticalText="<Bullet/>Standard armor providing a balance between mobility in the field and damage mitigation\n"

[HeavyKevlarArmor X2ArmorTemplate]
FriendlyName="Heavy Kevlar Armor"
FriendlyNamePlural="Heavy Kevlars"
BriefSummary="The heaviest armor we are capable of cobbling together. Thugh providing comparable protection to the ADVENT trooper armor, our soldiers will take a heavy hit to their mobility and defence while wearing it"
TacticalText="<Bullet/>Provides -10 defense.\n<Bullet/>Our heaviest armor currently available, providing the most protection.\n<Bullet/>Our heavy armor allows for an additional item slot.\n<Bullet/>Soldiers equipping will take a significant hit to their defence and mobility\n"

; Plate Variants

[LightPlateArmor X2ArmorTemplate]
FriendlyName="Light Predator Armor"
FriendlyNamePlural="Light Plate"
BriefSummary="This is an upgraded version of our light armor. Though it still sacrifices protection for mobility, this version does offer some level of protection."
TacticalText="<Bullet/>Provides +5 defense\n<Bullet/>Upgraded light armor still sacrifices protective measures to allow the greatest boost in mobility on the field.\n<Bullet/>This heightened mobility may give our operatives a greater chance of avoiding incoming fire in the right circumstances"

[MediumPlatedArmor X2ArmorTemplate]
FriendlyName="Medium Predator Armor"
FriendlyNamePlural="Medium Plate"
BriefSummary="An upgrade to our kevlar armor. Utilising looted alien alloys, we are able to make some tougher frontline armor, with additional support for equipment."
TacticalText="<Bullet/>Upgraded armor providing a balance between mobility in the field and damage mitigation\n<Bullet/>Allows for an additional item slot.\n"


[HeavyPlateArmor X2ArmorTemplate]
FriendlyName="Heavy Predator Armor"
FriendlyNamePlural="Heavy Plate"
BriefSummary="A significant upgrade to our kevlar heavy armor. Utilising looted alien alloys, we are able to make some incredibly tough plated armor for those fighting on the frontline."
TacticalText="<Bullet/>Provides -10 defense.\n<Bullet/>Our upgraded heavy armor, providing the most protection.\n<Bullet/>Our heavy armor allows for an additional item slot.\n"<Bullet/>Soldiers equipping will take a significant hit to their defence and mobility\n"

; Power Variants

[LightPowerArmor X2ArmorTemplate]
FriendlyName="Light Warden Armor"
FriendlyNamePlural="Light Power Armors"
BriefSummary="This is our most advanced light armor. Through superior refinement of the alien alloys, we are able to to include a micro shield generator without forfeiting any protective properties of the plate armor"
TacticalText="<Bullet/>Provides +5 defense\n<Bullet/>Provides 3 shield points\n<Bullet/>Upgraded light armor still sacrifices protective measures to allow the greatest boost in mobility on the field.\n<Bullet/>This heightened mobility may give our operatives a greater chance of avoiding incoming fire in the right circumstances"

[MediumPoweredArmor X2ArmorTemplate]
FriendlyName="Medium Warden Armor"
FriendlyNamePlural="Medium Power Armor"
BriefSummary="Our best available medium armor. Comes with a medium portable shield generator capable of absorbing incoming fire."
TacticalText="<Bullet/>Provides 4 shield points\n<Bullet/>Upgraded armor providing a balance between mobility in the field and damage mitigation\n<Bullet/>Allows for an additional item slot.\n"


[HeavyPowerArmor X2ArmorTemplate]
FriendlyName="Heavy Warden Armor"
FriendlyNamePlural="Heavy Power Armor"
BriefSummary="The heaviest power armor we can build. Mounting a heavy shield generator, this is the toughest our troops are going to get in the field."
TacticalText="<Bullet/>Provides 6 shield points\n<Bullet/>Provides -10 defense.\n<Bullet/>Our upgraded heavy armor, providing the most protection.\n<Bullet/>Our heavy armor allows for an additional item slot.\n"<Bullet/>Soldiers equipping will take a significant hit to their defence and mobility\n"

; EXO Suits

[PrototypeArmor X2ArmorTemplate]
FriendlyName="Prototype EXO Suit"
FriendlyNamePlural="Prototype EXO Suits"
BriefSummary="This armor is built off some old designs for a larger frame by the late Dr. Shen. Though suffering the same penalties to a soldier's defence as our heavier armors, without providing the same protection, The addition of the support servos allow our soldiers a way to bring heavy weapons to the field"
TacticalText="<Bullet/>Provides -10 defense.\n<Bullet/>Prototype armor based off our heavy variants, with some of the plating stripped out for more support functionality.\n<Bullet/>Allows for a heavy weapon to be equipped by the soldier in question\n"<Bullet/>Soldiers equipping will take a significant hit to their defence and mobility\n"

[PrototypeArmor X2TechTemplate]
DisplayName="Prototype E.X.O Suit"
Summary="In order to take on some of the Aliens's heavier support, we're going to need to be bringing bigger guns with us. Based on some older designs drawn up by the late Dr Shen for a somewhat larger frame battlesuit, we could potentially cobble something together which would allow our soldiers to field weapons they normally couldn't. However, the resultant armor would bring certain tradeoffs to our soldier's combat abilities."
CodeName="Razor"

[RangerExoArmor X2ArmorTemplate]
FriendlyName="EXO Smartgun Battlesuit"
FriendlyNamePlural="Smartgun EXO Suits"
BriefSummary="Based off the chassis of our current E.X.O suits, this armor focuses on enhancing our soldier's capabilities with their primary weapon. It forgoes the heavy weapon mount in favour of an advanced combat computer and a suite of targetting assistors."
TacticalText="<Bullet/>Provides -10 defense.\n<Bullet/>Sacrifices on the heavy weapon slot to enable the support servos to provide a greater degree of accuracy with the equipped weapon.\n<Bullet/>Can enter a Smartgun mode, allowing the engagement and destruction of multiple targets in quick succession.\n"<Bullet/>Soldiers equipping will take a significant hit to their defence, while.\n"

[RangerExoArmor X2TechTemplate]
DisplayName="E.X.O Smartgun Battlesuit"
Summary="Stripping out the heavy weapon in the conventional E.X.O chassis, we're able to mount an advanced combat computer that can greatly assist the equipped soldier with with rapid and deadly target acquisition. The downside to this is the suit offers no further protection over the original design, and scavenging the parts required to assemble the computer will take a significant investment of resources"
CodeName="Taipan"

[RangerWarArmor X2ArmorTemplate]
FriendlyName="WAR Smartgun Battlesuit"
FriendlyNamePlural="Prototype EXO Suits"
BriefSummary="This suit is a significant upgrade over our prevoius battlesuit design, mounting a personal shield generator and a more capable battle computer. As a downside, it still makes the same sacrifices as its predecessor."
TacticalText="<Bullet/>Provides -10 defense.\n<Bullet/>Provides 4 shields.\n<Bullet/>Sacrifices on the heavy weapon slot to enable the support servos to provide a greater degree of accuracy with the equipped weapon.\n<Bullet/>Can enter a Smartgun mode, allowing the engagement and destruction of multiple targets in quick succession.\n"<Bullet/>Soldiers equipping will take a significant hit to their defence, while.\n"

[RangerWarArmor X2TechTemplate]
DisplayName="W.A.R Smartgun Battlesuit"
Summary="Thanks to our advances in armor technology, we've been able to make significant improvements to our E.X.O chassis, including a shield generator. Also, conveniently, as the aliens are starting to field more advanced robotic units, provided we can get hold of their CPU units, we should be able to advance our own combat computer accordingly."
CodeName="Marauder"

; Spider suits

[LightPlatedArmor X2ArmorTemplate]
FriendlyName="Spider Suit"
FriendlyNamePlural="Spider Suits"
BriefSummary="This is a variant of our light armor for our more covert soldiers. This version focuses on stealth and reposition, featuring a grappling hook, and is a redesigned structure to be stealthier in the field."
TacticalText="<Bullet/>Provides +15 defense.\n<Bullet/>This version sacrifices effective armor plating in order to allow for quieter movement, granting a detection radius bonus.\n<Bullet/>This suit is also equipped with a grappling hook for clutch repositioning.\n"

[LightPoweredArmor X2ArmorTemplate]
FriendlyName="Wraith Suit"
FriendlyNamePlural="Wraith Suits"
BriefSummary="This is an upgraded variant of our light armor for our more covert soldiers. Thanks to advances in elerium, we are able to mount a full blown stealth generator on this suit, allowing our soldiers to fade into thin air."
TacticalText="<Bullet/>Provides +20 defense.\n<Bullet/>This version sacrifices effective armor plating in order to allow for quieter movement, granting a detection radius bonus.\n<Bullet/>Mounts a Filed manipulator, allowing our soldiers to pass cleanly through solid objects, or fade almost instantly from view.\n<Bullet/>This suit is also equipped with a grappling hook for clutch repositioning.\n"

[TrojanSpiderArmor X2ArmorTemplate]
FriendlyName="Spider Techsuit"
FriendlyNamePlural="Spider Techsuits"
BriefSummary="This is a variant of our light armor for our more covert soldiers. Mounting a cyberware suite, this suit allows our specialists to more easily breach enemy systems, all the while remaining unseen."
TacticalText="<Bullet/>Provides +15 defense.\n<Bullet/>This version sacrifices effective armor plating in order to allow for quieter movement, granting a detection radius bonus.\n<Bullet/>This version of the suit dopes not have a grappling hook.\n"

[TrojanSpiderArmor X2TechTemplate]
DisplayName="Spider Techsuit"
Summary="Our Cyberwarfare division has pushed for a suit that will help our operatives combat ADVENT's robotic units. Removing the grappling hook from the Spider suit blueprint, we're able to add a suit of hardware modules to help boost our specialists' hacking abilities in the field, whilst remaining covert."
CodeName="Trojan"

[TrojanWraithArmor X2ArmorTemplate]
FriendlyName="Wraith Techsuit"
FriendlyNamePlural="Wraith Techsuits"
BriefSummary="This is a variant of our light armor for our more covert soldiers. Mounting a cyberware suite, this suit allows our specialists to more easily breach enemy systems, all the while remaining unseen."
TacticalText="<Bullet/>Provides +20 defense.\n<Bullet/>This version sacrifices effective armor plating in order to allow for quieter movement, granting a detection radius bonus.\n<Bullet/>Contains a field manipulator, allowing for phasing through solid objects and intantaneous cloaking.<Bullet/>This version of the suit dopes not have a grappling hook.\n"

[TrojanWraithArmor X2TechTemplate]
DisplayName="Wraith Techsuit"
Summary="Serving as a direct upgrade to our Spider techsuit, this system once again forgoes the grappling hook for a field generator, and a greater cyberware suite computer system. This is a pefect system for compromising the enemy network, before slipping back into the shadows unnoticed."
CodeName="Firesale"